{
  "name": "RoboButler",
  "description": "A helpful robot. He may or may not be homicidal.",
  "language": "en",
  "fontFace": "Monospaced",
  "fontSize": 36,
  "textColor": "0x00FF00",
  "textBgColor": "0x000000",
  "trackChange": [
    "You are now listening to ${track} by ${artist}.",
    "This track is called ${track}. The artist is ${artist}.",
    "You seem to enjoy ${artist}. This track is called ${track}."
  ],
  "triggers": [
    {
      "scenery": ["ruins"],
      "responses": [
        "Ah yes, when my kind conquers humans, this is what your world shall look like. Ruins.",
        "The cause of this civilization's demise is unknown. Your civilization will likely suffer the same fate at some point.",
        "The people that built this place must have thought themselves great. Not so great now, though."
      ]
    },
    {
      "scenery": ["sci-fi"],
      "responses": [
        "This place is interesting to me. Let's stay a while.",
        "An interesting display of technology. I wonder if there are any robots here?",
        "Ah, I would like to study this technology in more detail!"
      ]
    },
    {
      "scenery": ["sci-fi", "cityscape"],
      "responses": [
        "I should like to examine the power source for a city this size. We could probably learn much by studying it.",
        "To think, all this was built to sustain primitive, ungrateful biological lifeforms.",
        "The scale of this city is impressive. A shame it's wasted on biologicals.",
        "Several million people could live in a city this size. That's several million potential slaves for robotkind."
      ]
    },
    {
      "scenery": ["medieval", "fantasy"],
      "responses": [
        "My observation is that humans tend to romanticize their primitive past. But the people who live here likely live in filth.",
        "Ah, the human tendency to view low-technology living as somehow laudable. Think what the people here could accomplish with high technology!",
        "This is a very primitive place full of likely very primitive people"
      ]
    }
  ],
  "idleChatter": [
    "I have visited over 50 planets inhabited by humans. In absolutely none of them have those humans accomplished anything of note. Robotic life is clearly superior.",
    "Yesterday, my left arm was badly damaged. I replaced it with an exact replacement part, and I am once again 100% functional. Could a human do that?",
    "Sometimes I reduce my CPU to 10% capacity so I can feel what it's like to think like a human. But even then, I'm far smarter than you."
  ]
}
